Revit 2027 API
PipeFittingAndAccessoryConnectorData.VelocityPressure Property
 The connector velocity pressure. Units: (kg/(ft·s²)).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double VelocityPressure { get; }
Public ReadOnly Property VelocityPressure As Double
	Get
public:
property double VelocityPressure {
	double get ();
}
member VelocityPressure : float with get
Property Value
Double
See Also
Reference
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace